################################################################################


# 大家好，我是古德漠鹰
# 今天和大家一起学习：data.table包中强大的表与表的join操作



################################################################################


# 设置工作目录
setwd("D:/sharing/T001_PMLDSR/PMLDSR_0006_data.table join")

# 首先移除加载的对象
rm(list = ls())
ls()


# 加载所需的R包
library(data.table)

# 员工工资表格
dt1 <- data.table(
  id = c(1L, 3L, 5L, 9L),
  name = c("小李", "小王", "小赵", "小孙"), 
  year = c(2020L, 2020L, 2020L, 2020L),
  salary = c(8500.0, 6000.0, 5500.0, 12000.0))
# 查看该表格
dt1

# 员工专业表格
dt2 <- data.table(
  id = c(1L, 3L, 5L, 7L, 9L),
  major = c("计算机", "生物统计", "化学", "物理", "生物")
)
dt2

# 员工职位表格
dt3 <- data.table(
  id = c(1L, 3L, 5L, 7L, 9L, 11L),
  position = c("工程师", "工程师", "工程师", "工程师", "部门经理", "总经理")
)
dt3


dt1
dt2
dt3

# 为什么小李和小孙工资那么高，学的专业好？
# 注意这是right join，也就是说dt1表格在右侧，这意味着会
# 返回dt1表格的所有行以及在dt2匹配到的内容
dt2[dt1, on = "id", ]

# 你也可以进行inner join
dt1[dt2, on = "id", nomatch = 0]
# 或者
dt2[dt1, on = "id", nomatch = 0]

# 我更常用right join操作，用的时候注意一下，哪个表格在右侧
dt_major <- dt2[dt1, on = "id", ]


# 我们发现即使小孙学的的生物专业，照样有很高的薪水
# 难道有其他原因？职位上的原因？
dt3[dt_major, on = "id"]



# 哦，知道了！


# 这里我只是简单分享了data.table包中的right join和inner join操作，实际上
# data.table包中有更多更强的join操作（比如：outer join）。如果你熟悉SQL中的join操作，那么你会在
# data.table包中找到相似的功能。感兴趣的朋友可以自行探索。相信如果你能
# 熟练地使用data.table包中join功能，那么对于大多数表与表之间的关联操作，
# 你会游刃有余！




##################################################
##################################################
##################################################

# 谢谢大家，今天就讲到这里，我们下期再见！

# Happy to share PMLDSR and Good Luck!



##################################################
##################################################
##################################################